{"keras_version": "2.0.6", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_1", "strides": [2, 2], "batch_input_shape": [null, 80, 160, 3], "padding": "valid", "dtype": "float32", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "dilation_rate": [1, 1], "filters": 24, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_2", "strides": [2, 2], "padding": "valid", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "dilation_rate": [1, 1], "filters": 34, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_3", "strides": [2, 2], "padding": "valid", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "dilation_rate": [1, 1], "filters": 44, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_4", "strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "dilation_rate": [1, 1], "filters": 52, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "name": "conv2d_5", "strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "dilation_rate": [1, 1], "filters": 52, "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "units": 1124, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "units": 100, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense3", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "units": 50, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense4", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "units": 10, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense5", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "units": 1, "activation": "sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_constraint": null}}], "backend": "tensorflow"}